app/controllers/products_controller.rb

  def show
    @product = Product.find_by_id(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 1]]